tap "DomT4/homebrew-autoupdate"

brew "bat"
brew "colima"
brew "composer"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "mas"
brew "neovim"
brew "node"
brew "php"
# Required by `brew autoupdate --sudo` to cache the sudo password securely.
brew "pinentry-mac"
brew "python"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "uv"
brew "zoxide"

cask "adguard"
cask "claude"
cask "claude-code"
cask "cmux"
cask "discord"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "protonvpn"
cask "signal"
cask "slack"
cask "tailscale-app"
cask "telegram"
cask "visual-studio-code"

mas "LanguageTool", id: 1534275760
mas "Refined GitHub", id: 1519867270

vscode "anthropic.claude-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
